tesseracts/cfd/case_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| generated by tesseracts/cfd/mesh/cgrid.py                                    |
\*-------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (1 0 -0.025)
    (0 0 -0.025)
    (0.5 0.052861502 -0.025)
    (0.5 -0.052861502 -0.025)
    (1 20 -0.025)
    (0 20 -0.025)
    (-20 0 -0.025)
    (0 -20 -0.025)
    (1 -20 -0.025)
    (25 20 -0.025)
    (25 0 -0.025)
    (25 -20 -0.025)
    (1 0 0.025)
    (0 0 0.025)
    (0.5 0.052861502 0.025)
    (0.5 -0.052861502 0.025)
    (1 20 0.025)
    (0 20 0.025)
    (-20 0 0.025)
    (0 -20 0.025)
    (1 -20 0.025)
    (25 20 0.025)
    (25 0 0.025)
    (25 -20 0.025)
);

blocks
(
    hex (0 4 5 2 12 16 17 14) (128 48 1) simpleGrading (231724 1 1)
    hex (2 5 6 1 14 17 18 13) (128 48 1) simpleGrading (231724 1 1)
    hex (1 6 7 3 13 18 19 15) (128 48 1) simpleGrading (231724 1 1)
    hex (3 7 8 0 15 19 20 12) (128 48 1) simpleGrading (231724 1 1)
    hex (0 10 9 4 12 22 21 16) (64 128 1) simpleGrading (300 231724 1)
    hex (0 8 11 10 12 20 23 22) (128 64 1) simpleGrading (231724 300 1)
);

edges
(
...
...
...
...
    arc 5 6 (-14.14213562 14.14213562 -0.025)
    arc 6 7 (-14.14213562 -14.14213562 -0.025)
...
...
...
...
    arc 17 18 (-14.14213562 14.14213562 0.025)
    arc 18 19 (-14.14213562 -14.14213562 0.025)
);

boundary
(
    airfoil
    {
        type wall;
        faces ((0 2 14 12) (2 1 13 14) (1 3 15 13) (3 0 12 15));
    }
    farfield
    {
        type patch;
        faces ((4 5 17 16) (5 6 18 17) (6 7 19 18) (7 8 20 19) (4 9 21 16) (11 8 20 23) (9 10 22 21) (10 11 23 22));
    }
    front
    {
        type empty;
        faces ((12 16 17 14) (14 17 18 13) (13 18 19 15) (15 19 20 12) (12 22 21 16) (12 20 23 22));
    }
    back
    {
        type empty;
        faces ((0 4 5 2) (2 5 6 1) (1 6 7 3) (3 7 8 0) (0 10 9 4) (0 8 11 10));
    }
);
