tesseracts/cfd/case_template/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);

boundaryField
{
    airfoil   { type noSlip; }
    farfield  { type freestreamVelocity; freestreamValue uniform (1 0 0); }
    "(front|back)" { type empty; }
}
