tesseracts/cfd/case_template/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    airfoil   { type zeroGradient; }
    farfield  { type freestreamPressure; freestreamValue uniform 0; }
    "(front|back)" { type empty; }
}
