tesseracts/cfd/case_template/0/nuTilda
FoamFile { version 2.0; format ascii; class volScalarField; object nuTilda; }

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 4.5e-06;

boundaryField
{
    airfoil   { type fixedValue; value uniform 0; }
    farfield  { type freestream; freestreamValue uniform 4.5e-06; }
    "(front|back)" { type empty; }
}
