tesseracts/cfd/case_template/0/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    airfoil   { type nutLowReWallFunction; value uniform 0; }
    farfield  { type freestream; freestreamValue uniform 0; }
    "(front|back)" { type empty; }
}
